# Pandas

**Ecommerce_Purchases,csv**

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels=['a','b','c']

In [4]:
my_data=[10,20,30]

In [5]:
arr=np.array(my_data)
arr

array([10, 20, 30])

In [6]:
d={'a':10,'b':20,'c':30}

In [7]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
ser1=pd.Series(my_data)

In [12]:
ser1[0]

10

In [13]:
ser2=pd.Series(my_data,labels)

In [14]:
ser1+ser2

0   NaN
1   NaN
2   NaN
a   NaN
b   NaN
c   NaN
dtype: float64

## DataFrames

In [15]:
df=pd.DataFrame(np.random.rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [16]:
df

          W         X         Y         Z
A  0.474670  0.752171  0.655791  0.532220
B  0.798533  0.603565  0.059239  0.498495
C  0.548204  0.401989  0.639352  0.760939
D  0.234389  0.282405  0.631668  0.863536
E  0.353615  0.951662  0.662940  0.815383

In [17]:
df['W']

A    0.474670
B    0.798533
C    0.548204
D    0.234389
E    0.353615
Name: W, dtype: float64

In [18]:
type(df['W'])

pandas.core.series.Series

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df[['W','Z']]

          W         Z
A  0.474670  0.532220
B  0.798533  0.498495
C  0.548204  0.760939
D  0.234389  0.863536
E  0.353615  0.815383

In [21]:
df['new']=df['W']+df['Y']

In [22]:
df

          W         X         Y         Z       new
A  0.474670  0.752171  0.655791  0.532220  1.130461
B  0.798533  0.603565  0.059239  0.498495  0.857772
C  0.548204  0.401989  0.639352  0.760939  1.187556
D  0.234389  0.282405  0.631668  0.863536  0.866057
E  0.353615  0.951662  0.662940  0.815383  1.016555

In [23]:
df.drop('new',axis=1,inplace=True)

In [24]:
df

          W         X         Y         Z
A  0.474670  0.752171  0.655791  0.532220
B  0.798533  0.603565  0.059239  0.498495
C  0.548204  0.401989  0.639352  0.760939
D  0.234389  0.282405  0.631668  0.863536
E  0.353615  0.951662  0.662940  0.815383

In [25]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.474670  0.752171  0.655791  0.532220
B  0.798533  0.603565  0.059239  0.498495
C  0.548204  0.401989  0.639352  0.760939
D  0.234389  0.282405  0.631668  0.863536

In [26]:
df.shape

(5, 4)

In [37]:
df.iloc[:3]

          W         X         Y         Z
A  0.474670  0.752171  0.655791  0.532220
B  0.798533  0.603565  0.059239  0.498495
C  0.548204  0.401989  0.639352  0.760939

In [34]:
df.loc['B','Y']

0.021312593742446317

In [35]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.619436  0.124955
B  0.349162  0.021313

In [36]:
bool_df=df>0

In [37]:
bool_df

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [40]:
df[df['W']>0]['X']

A    0.793865
B    0.460240
C    0.017266
D    0.385443
E    0.147346
Name: X, dtype: float64

In [41]:
df

          W         X         Y         Z
A  0.619436  0.793865  0.124955  0.698117
B  0.349162  0.460240  0.021313  0.731717
C  0.248897  0.017266  0.880236  0.431352
D  0.248544  0.385443  0.475010  0.667177
E  0.012575  0.147346  0.427243  0.432499

In [43]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.619436  0.793865  0.124955  0.698117
1     B  0.349162  0.460240  0.021313  0.731717
2     C  0.248897  0.017266  0.880236  0.431352
3     D  0.248544  0.385443  0.475010  0.667177
4     E  0.012575  0.147346  0.427243  0.432499

In [44]:
newind='CA NY AU OR CO'.split()

In [45]:
newind

['CA', 'NY', 'AU', 'OR', 'CO']

In [46]:
df['states']=newind

In [47]:
df

          W         X         Y         Z states
A  0.619436  0.793865  0.124955  0.698117     CA
B  0.349162  0.460240  0.021313  0.731717     NY
C  0.248897  0.017266  0.880236  0.431352     AU
D  0.248544  0.385443  0.475010  0.667177     OR
E  0.012575  0.147346  0.427243  0.432499     CO

In [49]:
df.reset_index(inplace=True)

In [50]:
df

  index         W         X         Y         Z states
0     A  0.619436  0.793865  0.124955  0.698117     CA
1     B  0.349162  0.460240  0.021313  0.731717     NY
2     C  0.248897  0.017266  0.880236  0.431352     AU
3     D  0.248544  0.385443  0.475010  0.667177     OR
4     E  0.012575  0.147346  0.427243  0.432499     CO

In [51]:
df.set_index('states',inplace=True)

In [52]:
df

       index         W         X         Y         Z
states
CA         A  0.619436  0.793865  0.124955  0.698117
NY         B  0.349162  0.460240  0.021313  0.731717
AU         C  0.248897  0.017266  0.880236  0.431352
OR         D  0.248544  0.385443  0.475010  0.667177
CO         E  0.012575  0.147346  0.427243  0.432499

In [54]:
d={'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,3]}

In [55]:
df=pd.DataFrame(d)

In [56]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [57]:
df.dropna(axis=0)

     A    B  C
0  1.0  1.0  1

In [58]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [59]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [60]:
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [61]:
df.fillna(value='Fill')

      A     B  C
0     1     1  1
1     2  Fill  2
2  Fill  Fill  3

In [62]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [64]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [65]:
data_df=pd.DataFrame(data)

In [66]:
data_df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [69]:
byComp=data_df.groupby('Company')

In [70]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [71]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

More examples of aggregate methods:

In [38]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [39]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [40]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [41]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [42]:
by_comp.describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [43]:
by_comp.describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [44]:
by_comp.describe().transpose()['GOOG']

       count   mean        std    min    25%    50%    75%    max
Sales    2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0

In [79]:
data_df.groupby('Person').sum().loc['Carl']

Sales    243
Name: Carl, dtype: int64

In [81]:
data_df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [82]:
data= pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [83]:
data

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [86]:
data['col2'].unique()

array([444, 555, 666], dtype=int64)

In [87]:
data['col2'].nunique()

3

In [91]:
data['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [92]:
data['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [98]:
data.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [99]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [101]:
data.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [103]:
data.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Notes

**Requires the required packages(pip install xlrd)**

* pd.read_excel('Excel_sample.xlsx',sheetname='Sheet1')
* df.to_excel('Excel_sample2.xlsx',sheet_name='New_sheet')

### Economic Purchases Example

In [3]:
ecom=pd.read_csv('Ecommerce Purchases.csv')

In [4]:
#head of the Dataframe
ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [5]:
#Row and column informaton along with what type of data is stored
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Address             10000 non-null object
Lot                 10000 non-null object
AM or PM            10000 non-null object
Browser Info        10000 non-null object
Company             10000 non-null object
Credit Card         10000 non-null int64
CC Exp Date         10000 non-null object
CC Security Code    10000 non-null int64
CC Provider         10000 non-null object
Email               10000 non-null object
Job                 10000 non-null object
IP Address          10000 non-null object
Language            10000 non-null object
Purchase Price      10000 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [7]:
#Average purchase price
ecom['Purchase Price'].mean()

50.34730200000025

In [8]:
#Highest Purchase price
ecom['Purchase Price'].max()

99.99

In [9]:
#Lowest purchase price
ecom['Purchase Price'].min()

0.0

In [18]:
#People that have English 'en' as their Language of choice on the website
ecom[ecom['Language']=='en'].count()

Address             1098
Lot                 1098
AM or PM            1098
Browser Info        1098
Company             1098
Credit Card         1098
CC Exp Date         1098
CC Security Code    1098
CC Provider         1098
Email               1098
Job                 1098
IP Address          1098
Language            1098
Purchase Price      1098
dtype: int64

In [30]:
#People habing job title as lawyer
ecom[ecom['Job']=='Lawyer'].count()

Address             30
Lot                 30
AM or PM            30
Browser Info        30
Company             30
Credit Card         30
CC Exp Date         30
CC Security Code    30
CC Provider         30
Email               30
Job                 30
IP Address          30
Language            30
Purchase Price      30
dtype: int64

In [28]:
#People that made the purchase during the AM and people that made the purchase during PM
ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [33]:
#5 most common job titles
ecom['Job'].value_counts().head()

Interior and spatial designer        31
Lawyer                               30
Social researcher                    28
Purchasing manager                   27
Research officer, political party    27
Name: Job, dtype: int64

In [36]:
#Someone made a purchase that came from Lot: "90 WT" , what was the Purchase Price for this transaction
ecom[ecom['Lot']=='90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [39]:
#email of the person with the following Credit Card Number: 4926535242672853
ecom[ecom['Credit Card']==4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [93]:
#People have American Express as their Credit Card Provider and made a purchase above $95
ecom[(ecom['CC Provider']=='American Express') & (ecom['Purchase Price']>=95.00)].count()

Address             39
Lot                 39
AM or PM            39
Browser Info        39
Company             39
Credit Card         39
CC Exp Date         39
CC Security Code    39
CC Provider         39
Email               39
Job                 39
IP Address          39
Language            39
Purchase Price      39
dtype: int64

In [102]:
#How many people have a credit card that expires in 2025

# count=0
# for i in range(10000):
#     if(ecom['CC Exp Date'][i].split("/")[1]=='25')==True:
#         count+=1
# print(count)

sum(ecom['CC Exp Date'].apply(lambda exp:exp[3:]=='25'))

1033

In [109]:
#What are the top 5 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...)
ecom['Email'].apply(lambda email:email.split("@")[1]).value_counts().head()

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

### Salaries Exercise

In [2]:
#Reading salaries.csv file
sal=pd.read_csv('Salaries.csv')

In [3]:
#Head of the dataframe
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [5]:
sal['BasePay'].mean()

66325.44884050643

In [6]:
sal['OvertimePay'].max()

245131.88

In [8]:
#Job title of employee
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [11]:
#How much does JOSEPH DRISCOLL make (including benefits)
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [16]:
#What is the name of highest paid person (including benefits)?
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [17]:
#What is the name of lowest paid person (including benefits)?
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [18]:
#What was the average (mean) BasePay of all employees per year? (2011-2014) ?
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [21]:
#How many unique job titles are there
sal['JobTitle'].nunique()

2159

In [23]:
#What are the top 5 most common jobs?
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [28]:
#How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)
sum(sal[sal['Year']==2013]['JobTitle'].value_counts()==1)

202

In [32]:
#How many people have the word Chief in their job title?
def chief_string(title):
    if 'chief' in title.lower().split():
        return True
    else:
        return False

In [34]:
sum(sal['JobTitle'].apply(lambda x:chief_string(x)))

477

In [35]:
sal['title_len']=sal['JobTitle'].apply(len)

In [36]:
#Is there a correlation between length of the Job Title string and Salary
sal[['title_len','TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000